# Quest steps
QUEST_STEPS = [
    {
        "hint":
        ("Мы спрятали 9 стикеров по всей территории фестиваля 👀 Сможешь найти все? Мы в тебя верим!\n\n"
         "Тебе нужно:\n"
         "— найти стикеры на территории фестиваля по подсказкам\n"
         "— отсканировать все QR-коды через бот\n"
         "— финишировать в лаунже Avito Team\n\n"
         "В конце квеста всех участников будут ждать призы! А самых быстрых — мерч от команды Avito Team. Классно? Тогда переходим к подсказкам…"
         ),
        "sticker_path":
        "img/quest.jpeg"
    },
    {
        "hint":
        ("Ты — как корабль в море звуков. А я — тот, кто ведёт тебя сквозь шторм и ритм. "
         "Ищи меня там, где бьётся сердце Дикой Мяты. "),
        "sticker_path":
        "img/step1.png"
    },
    {
        "hint":
        ("Здесь начинается первое путешествие по миру музыки. "
         "Ищи меня там, где зрители ниже сцены, но энергия — выше крыши."),
        "sticker_path":
        "img/step2.png"
    },
    {
        "hint":
        ("Чтобы найти верный путь, загляни туда, где вещи хранят тепло рук и дух мест, откуда они пришли. "
         "Ищи меня среди уникального и сделанного с душой. "),
        "sticker_path":
        "img/step3.png"
    },
    {
        "hint":
        ("Здесь царит дружба, расслабление и покой. Можно отдохнуть душой и обрести новых друзей. "
         "Ищи меня среди мягких подушек в цветах Авито.  "),
        "sticker_path":
        "img/step4.png"
    },
    {
        "hint":
        ("Азарт, смех и дух соперничества тут! Где победа сладка, а поражение — лишь шаг вперёд. "
         ),
        "sticker_path":
        "img/step5.png"
    },
    {
        "hint":
        ("Здесь шестерёнки креатива крутятся без устали. Найди меня среди бусин и проволоки — там, где можно создать что-то прекрасное. "
         ),
        "sticker_path":
        "img/step6.png"
    },
    {
        "hint":
        ("Это место не для тех, кто сидит на месте. Найди меня там, где пыль летит, мотор рычит — и ты становишься героем экшена. "
         ),
        "sticker_path":
        "img/step7.png"
    },
    {
        "hint":
        ("Здесь можно присесть, перевести дух и оглядеться. Маяк рядом — а значит, ты на верном пути. "
         "Ищи меня там, где начинаются хорошие истории."),
        "sticker_path":
        "img/step8.png"
    },
    {
        "hint":
        ("Это место важно для нас и наполнено красотой и гармонией. Найди уголок нашего живого символа среды, в которой можно расти. "
         ),
        "sticker_path":
        "img/step9.png"
    },
]
QUEST_TOTAL_STEPS = len(QUEST_STEPS) - 1  # step 0 — интро
